app/Http/Middleware/AuditMiddleware.php

    public function handle(Request $request, Closure $next): Response
    {
        $response = $next($request);

        if (config('app.audit_enabled', true) && auth()->check()) {
            if ($request->isMethod('GET') && ! $request->ajax()) {
                $user = auth()->user();

                AuditLog::create([
                    'user_id' => $user->id,
                    'event' => 'view',
                    'url' => $request->fullUrl(),
                    'ip_address' => $request->ip(),
                    'user_agent' => $request->userAgent(),
                ]);
---
insert into `audit_logs` (`user_id`, `event`, `url`, `ip_address`, `user_agent`, `updated_at`, `created_at`) values (7, 'view', 'http://localhost/torre360/public/admin', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/148.0.0.0 Safari/537.36', '2026-06-16 22:02:41', '2026-06-16 22:02:41')