app/Filament/Pages/Auth/CustomLogin.php

select * from `users` where `email` = 'admin@admin.com' limit 1
---
    public function authenticate(): ?LoginResponse
    {
        try {
            return parent::authenticate();
        } catch (ValidationException $e) {
            $data = $this->form->getState();
            $user = User::where('email', $data['email'] ?? null)->first();