app/Filament/Widgets/AlunosPorTurmaChart.php

select `turma`.*, (select count(*) from `matricula` where `turma`.`id` = `matricula`.`turma_id`) as `matriculas_count` from `turma`
---
    protected function getData(): array
    {
        $data = Turma::ativas()->withCount('matriculas')->get();

        return [
            'datasets' => [
                [
                    'label' => 'Alunos',
                    'data' => $data->pluck('matriculas_count')->toArray(),
                    'backgroundColor' => [
                        '#3b82f6', '#10b981', '#f59e0b', '#ef4444', '#8b5cf6', '#ec4899', '#06b6d4', '#f97316',
                    ],
                ],
            ],
            'labels' => $data->map(fn (Turma $t) => "{$t->nome} ({$t->matriculas_count})")->toArray(),
        ];