app/Filament/Widgets/InteressadoStatusChart.php

select status_interessado.nome, count(*) as total, status_interessado.ordem from `interessado` inner join `status_interessado` on `interessado`.`status_interessado_id` = `status_interessado`.`id` group by `status_interessado`.`nome`, `status_interessado`.`ordem` order by `status_interessado`.`ordem` asc
---
    protected function getData(): array
    {
        $data = Interessado::query()
            ->join('status_interessado', 'interessado.status_interessado_id', '=', 'status_interessado.id')
            ->selectRaw('status_interessado.nome, count(*) as total, status_interessado.ordem')
            ->groupBy('status_interessado.nome', 'status_interessado.ordem')
            ->orderBy('status_interessado.ordem')
            ->get();

        return [
            'datasets' => [
                [
                    'label' => 'Total',
                    'data' => $data->pluck('total')->toArray(),
                    'backgroundColor' => 'rgba(153, 102, 255, 0.6)',
                ],
            ],
            'labels' => $data->pluck('nome')->toArray(),
        ];