app/Filament/Widgets/InteressadoOrigemChart.php

select origem_interessado.nome, count(*) as total from `interessado` inner join `origem_interessado` on `interessado`.`origem_interessado_id` = `origem_interessado`.`id` group by `origem_interessado`.`nome`
---
    protected function getData(): array
    {
        $data = Interessado::query()
            ->join('origem_interessado', 'interessado.origem_interessado_id', '=', 'origem_interessado.id')
            ->selectRaw('origem_interessado.nome, count(*) as total')
            ->groupBy('origem_interessado.nome')
            ->pluck('total', 'nome');