app/Filament/Widgets/PreceptoriaSchedulingWidget.php

    protected function getStats(): array
    {
        /** @var User $user */
        $user = Auth::user();

        if (! $user) {
            return [];
        }

        $activeRole = $user->active_role;

        // Buscar todas as pessoas vinculadas ao usuário
        $pessoasIds = $user->pessoas()->pluck('pessoa.id')->toArray();
---
select `pessoa`.`id` from `pessoa` inner join `pessoa_user` on `pessoa`.`id` = `pessoa_user`.`pessoa_id` where `pessoa_user`.`user_id` = 87