app/Filament/Widgets/QuestionariosPendentes.php

    public function getQuestionarios()
    {
        $user = Auth::user();
        if (! $user) {
            return collect();
        }

        return Questionario::query()
            ->where('is_ativo', true)
            ->where(function ($q) {
                $q->whereNull('inicio_aplicacao')->orWhere('inicio_aplicacao', '<=', now());
            })
            ->where(function ($q) {
                $q->whereNull('fim_aplicacao')->orWhere('fim_aplicacao', '>=', now());
            })
            ->get()
            ->filter(fn ($q) => $q->podeSerRespondidoPor($user))
            ->filter(function ($q) use ($user) {
                // Se o questionário não for anônimo, verificamos se o usuário logado já respondeu
                if (! $q->is_anonimo) {
                    return ! QuestionarioResposta::where('questionario_id', $q->id)
                        ->where('user_id', $user->id)
                        ->where('status', 'enviado')
                        ->exists();
                }

                // Para questionários anônimos, mostramos sempre (pois não rastreamos o usuário)
                return true;
            });
---
select * from `questionarios` where `is_ativo` = 1 and (`inicio_aplicacao` is null or `inicio_aplicacao` <= '2026-06-16 22:02:13') and (`fim_aplicacao` is null or `fim_aplicacao` >= '2026-06-16 22:02:13') and `questionarios`.`deleted_at` is null
select exists(select * from `questionario_respostas` where `questionario_id` = 1 and `user_id` = 7 and `status` = 'enviado') as `exists`