app/Filament/Widgets/QueueSupervisorWidget.php

    public function getQueueStatus(): array
    {
        $pendingJobs = DB::table('jobs')->count();
        $failedJobs = DB::table('failed_jobs')->count();
---
select count(*) as aggregate from `failed_jobs`