app/Filament/Widgets/StatsOverview.php

    protected function getStats(): array
    {
        return [
            Stat::make('Total de Pessoas', Pessoa::count())
                ->description('Total de pessoas cadastradas')
                ->descriptionIcon('heroicon-m-user-group')
                ->color('primary'),
            Stat::make('Matrículas Ativas', Matricula::count())
                ->description('Dentro do período letivo atual')
                ->descriptionIcon('heroicon-m-check-badge')
                ->color('success'),
            Stat::make('Turmas Ativas', Turma::count())
                ->description('Contagem por período')
                ->descriptionIcon('heroicon-m-academic-cap')
                ->color('info'),
        ];
---
select count(*) as aggregate from `pessoa`
select count(*) as aggregate from `matricula`
select count(*) as aggregate from `turma`