app/Models/User.php

    public function getPessoaAttribute(): ?Pessoa
    {
        return $this->pessoas->first();
---
select `pessoa`.*, `pessoa_user`.`user_id` as `pivot_user_id`, `pessoa_user`.`pessoa_id` as `pivot_pessoa_id` from `pessoa` inner join `pessoa_user` on `pessoa`.`id` = `pessoa_user`.`pessoa_id` where `pessoa_user`.`user_id` = 7