app/Filament/Resources/Interessados/InteressadoResource.php

select * from `status_interessado` where `nome` = 'Novo' limit 1
---
    public static function getNavigationBadge(): ?string
    {
        /** @var StatusInteressado $status */
        $status = StatusInteressado::where('nome', 'Novo')->first();